Tekla Open API Reference for Tekla Structures 2025
AnalysisRestraintData.Supported Property
 The support condition.
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public AnalysisRestraintData.SupportedEnum Supported { get; set; }
Public Property Supported As AnalysisRestraintData.SupportedEnum
	Get
	Set
Property Value
Type: AnalysisRestraintData.SupportedEnum
See Also
Reference
AnalysisRestraintData Class
Tekla.Structures.Analysis Namespace